{
    "descriptionLinks": [
        "Calculate Fermi Surface: https://docs.exabyte.io/tutorials/dft/electronic/fermi-surface/"
    ], 
    "description": "In this tutorial, we show how to calculate and visualize the Fermi Surface of metallic samples using our Web Interface, for the simple case of crystalline copper.", 
    "title": "Exabyte.io Tutorial: Calculate Fermi Surface", 
    "tags": [
        {
            "...": "../../../metadata/general.json#/tags"
        }, 
        {
            "...": "../../../models-directory/dft.json#/tags"
        }, 
        {
            "...": "../../../software-directory/modeling/quantum-espresso.json#/tags"
        }, 
        {
            "...": "../../../properties-directory/scalar/fermi-surface.json#/tags"
        }, 
        "copper"
    ], 
    "youTubeCaptions": [
        {
            "text": "Fermi Surface tutorial.", 
            "endTime": "00:00:02.000", 
            "startTime": "00:00:00.000"
        }, 
        {
            "text": "Create a simulation, by navigating to the job designer page.", 
            "endTime": "00:00:07.000", 
            "startTime": "00:00:03.000"
        }, 
        {
            "text": "Then, <break time='0.5' /> inside the materials tab, choose 'copper' as the main simulation material, by selecting it in the list. <break time='3.0' />", 
            "endTime": "0:00:14.000", 
            "startTime": "0:00:07.000"
        }, 
        {
            "text": "Then, <break time='0.5' /> open the workflow tab, and choose the 'Band Structure + Density of States' workflow by selecting it in the list. <break time='4.0' />", 
            "endTime": "0:00:24.000", 
            "startTime": "0:00:17.000"
        }, 
        {
            "text": "After that, <break time='0.5' /> navigate to compute tab, and set compute configuration. Here, we use one node with four cores.", 
            "endTime": "0:00:35.000", 
            "startTime": "0:00:28.000"
        }, 
        {
            "text": "Then, <break time='0.5' /> set the name for the job. Here, we call it - Copper Fermi Surface Calculation. <break time='5.0' />", 
            "endTime": "0:00:42.000", 
            "startTime": "0:00:36.000"
        }, 
        {
            "text": "Next, <break time='0.5' /> save the job. <break time='5.0' /> It can then be selected and submitted to the compute queue, for execution. <break time='2.0' />", 
            "endTime": "0:00:57.000", 
            "startTime": "0:00:47.000"
        }, 
        {
            "text": "The status of the calculation will, accordingly, change from submitted, to active.  Please wait, until the job has finished running.", 
            "endTime": "0:01:07.000", 
            "startTime": "0:00:58.000"
        }, 
        {
            "text": "When the job is finished, open the right-hand sidebar, and then open an instance of the web terminal.", 
            "endTime": "0:01:14.000", 
            "startTime": "0:01:09.000"
        }, 
        {
            "text": "On the command line, navigate to the simulation working directory on the relevant cluster, where the simulation files are located. <break time='8.0' /> Once in the correct folder, open the 'fs.in' file in your favourite command based text editor, to inspect its contents. ", 
            "endTime": "0:01:39.500", 
            "startTime": "0:01:16.500"
        }, 
        {
            "text": "Then, load Quantum Espresso as a module, to add it to the environment, via the 'module load' command.", 
            "endTime": "0:01:49.000", 
            "startTime": "0:01:44.000"
        }, 
        {
            "text": "Run the 'fs.x' quantum espresso executable on the aforementioned 'fs.in' input file, and wait for execution to finish.", 
            "endTime": "0:02:04.500", 
            "startTime": "0:01:55.500"
        }, 
        {
            "text": "At the end of execution, a new file with the '.bxsf' extension will hence be generated inside the current working directory. This file can now be used to visualize the Fermi surface of copper, based on the information that it contains.", 
            "endTime": "0:02:26.500", 
            "startTime": "0:02:12.000"
        }, 
        {
            "text": "Now close the current Web Terminal session. Then, open a new Remote Desktop session, via the right-hand sidebar of the main web interface of our platform.", 
            "endTime": "0:02:36.000", 
            "startTime": "0:02:27.000"
        }, 
        {
            "text": "Open the 'Applications' menu, located at the top of the Remote Desktop interface. Here, navigate to the 'XCrysDen' analysis and visualization software option, and open it.", 
            "endTime": "0:02:50.000", 
            "startTime": "0:02:39.000"
        }, 
        {
            "text": "Click on 'File' <break time='3.0' />, then 'Open Structure' <break time='3.0' />, and finally the 'Open BXSF' option. <break time='3.0' /> Then, navigate to the simulation working directory on the relevant cluster, where the simulation files are located. <break time='10.0' /> Once in the correct folder, double click to open the relevant 'bxsf' output file, containing the fermi surface data for our copper simulation.", 
            "endTime": "0:03:30.000", 
            "startTime": "0:02:51.500"
        }, 
        {
            "text": "Accept the default value for the Fermi energy. <break time='5.0' /> Then, select the appropriate bands for drawing the Fermi Surface.", 
            "endTime": "0:03:44.500", 
            "startTime": "0:03:31.500"
        }, 
        {
            "text": "The graphic visualization for the Fermi Surface of copper will thus appear, within the main interface of Xcrysden. <break time='6.0' /> This visualization can be freely inspected by the user, via, for instance, the multiple available graphic appearance options included on the left-hand sidebar of the Xcrysden interface.", 
            "endTime": "0:04:14.500", 
            "startTime": "0:03:50.500"
        }, 
        {
            "text": "This completes the present tutorial.", 
            "endTime": "0:04:29.000", 
            "startTime": "0:04:26.500"
        }
    ], 
    "youTubeId": "n5_QSYegBK4"
}