{
    "descriptionLinks": [
        "Create Constrained Interpolated Sets: https://docs.exabyte.io/tutorials/materials/interpolated-sets/"
    ],
    "description": "This video animation demonstrates how to create an interpolated set, necessary for the calculation of the energy profile and activation barrier for the multi-dimensional energy space of chemical reactions via the Nudged Elastic Bands (NEB) method. Since the molecules considered in this example are entirely one-dimensional, we include atomic constraints limiting the movement of atoms to only this single dimension.",
    "tags": [
        {
            "...": "../../metadata/general.json#/tags"
        },
        {
            "...": "../../metadata/chemical.json#/tags"
        },
        {
            "...": "../../materials-designer/header-menu/advanced/interpolated-set.json#/tags"
        },
        {
            "...": "../../models/auxiliary-concepts/nudged-elastic-band.json#/tags"
        }
    ],
    "title": "Exabyte.io Tutorial: Create Constrained Interpolated Sets",
    "youTubeCaptions": [
        {
            "text": "Create Constrained Interpolated Sets tutorial.",
            "endTime": "00:00:03.000",
            "startTime": "00:00:00.000"
        },
        {
            "text": "Open the Materials Designer interface, via the corresponding 'Create' button.",
            "endTime": "0:00:07.000",
            "startTime": "0:00:03.500"
        },
        {
            "text": "From within the Materials Designer interface, <break time='0.5' /> open the 'Input/Output' menu, <break time='0.2' /> and import the initial and final H3 molecules via the relevant option.",
            "endTime": "0:00:18.000",
            "startTime": "0:00:08.500"
        },
        {
            "text": "Let us also delete the original default silicon material.",
            "endTime": "0:00:24.000",
            "startTime": "0:00:19.500"
        },
        {
            "text": "Now we need to clone and rename both the initial and final structures, via the relevant option under the 'Edit' menu, for a correct final attribution of the indices within the resulting ordered set. <break time='4' /> Please repeat the same procedure for both structures.",
            "endTime": "0:00:47.000",
            "startTime": "0:00:28.000"
        },
        {
            "text": "We also need to delete the original structures from the left-hand items list sidebar.",
            "endTime": "0:00:53.500",
            "startTime": "0:00:49.500"
        },
        {
            "text": "Let us take a moment to inspect both the initial and final H3 molecular structures, with the help of the interactive 3D viewer.",
            "endTime": "0:01:02.000",
            "startTime": "0:00:54.000"
        },
        {
            "text": "We now add the relaxation constraints for ensuing N.E.B. computations, by inserting a zero for those atomic coordinates that need to be held fixed, and a one for those that are allowed to move. In this case the constraints are already present.",
            "endTime": "0:01:24.500",
            "startTime": "0:01:10.000"
        },
        {
            "text": "We thus allow the x coordinates to relax, since our H3 molecules are entirely one-dimensional along x, except for the atom at the origin, which is instead kept completely fixed.",
            "endTime": "0:01:35.500",
            "startTime": "0:01:25.000"
        },
        {
            "text": "Then, open the 'Advanced' menu option, in order to generate an interpolated set.",
            "endTime": "0:01:41.500",
            "startTime": "0:01:36.000"
        },
        {
            "text": "We select to generate three intermediate images between the initial and final structures within the interpolated set.",
            "endTime": "0:01:48.000",
            "startTime": "0:01:42.000"
        },
        {
            "text": "This will add the intermediate images to the left-hand sidebar list of structures, on top of the original initial and final images.",
            "endTime": "0:01:55.500",
            "startTime": "0:01:48.500"
        },
        {
            "text": "Let us now cycle through all images comprised within the resulting interpolated set, in order to observe the corresponding shift in the Hydrogen atomic positions within the H3 molecule.",
            "endTime": "0:02:06.500",
            "startTime": "0:01:56.000"
        },
        {
            "text": "We now save the entire interpolated set to our Materials collection, via the corresponding option under the 'Input/Output' menu, after inserting a couple of descriptive tags.",
            "endTime": "0:02:17.000",
            "startTime": "0:02:07.500"
        },
        {
            "text": "We choose to save the interpolated set within a new folder set in our Materials collection, which we create purposely via the relevant option.",
            "endTime": "0:02:28.000",
            "startTime": "0:02:19.000"
        },
        {
            "text": "We call our new set 'CONSTRAINED SET', <break time='8' /> and then change its type to 'ordered', such that every image within the interpolated set will have a unique ordering index attributed to it.",
            "endTime": "0:02:48.000",
            "startTime": "0:02:30.000"
        },
        {
            "text": "We finally select the newly-created ordered set for saving the contents of our interpolated set, and wait until the saving operation is completed.",
            "endTime": "0:02:58.000",
            "startTime": "0:02:49.000"
        },
        {
            "text": "Now open the 'Input/Output' menu to exit the Materials Designer interface, and return to the original Materials collection page, where the new 'CONSTRAINED SET' can be retrieved for inspection of its contents.",
            "endTime": "0:03:13.500",
            "startTime": "0:03:02.500"
        },
        {
            "text": "Inside the 'CONSTRAINED SET', the user will be able to see the complete list of image structures of the H3 molecule comprised within our interpolated set, of which there are five in total. <break time='0.5' /> Each one has its own ordering index assigned to it.",
            "endTime": "0:03:28.500",
            "startTime": "0:03:14.000"
        },
        {
            "text": "Let us conclude this tutorial by visualizing the contents of the 'CONSTRAINED SET', via the relevant option in the Materials Explorer interface.",
            "endTime": "00:03:37.000",
            "startTime": "00:03:29.000"
        },
        {
            "text": "This allows us to inspect the entire interpolated set, including initial, final and intermediate images, within a single instance of the Materials Viewer interface.",
            "endTime": "00:03:48.000",
            "startTime": "00:03:38.000"
        },
        {
            "text": "Let us cycle through all images again.",
            "endTime": "0:03:53.500",
            "startTime": "0:03:50.000"
        },
        {
            "text": "This completes the present tutorial.",
            "endTime": "0:03:59.000",
            "startTime": "0:03:56.500"
        }
    ],
    "youTubeId": "je1CgaMOFQ4"
}
